eisup_2019_docmng_integration/src/Documents/ttk_ЗаявкаНаОтгрузку/ttk_ЗаявкаНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ttk_ЗаявкаНаОтгрузку</name>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.ttk_ВидыОснованийЗаявкиНаОтгрузку</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторОтгрузки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПередачаТоваров</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>DocumentRef.абс_АВИЗО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ttk_ИзменениеСтатусовЗаявокНаОтгрузку/ttk_ИзменениеСтатусовЗаявокНаОтгрузку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ttk_ИзменениеСтатусовЗаявокНаОтгрузку</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ttk_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаОтгрузку</name>
    <type>
      <types>DocumentRef.ttk_ЗаявкаНаОтгрузку</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ttk_ЗаявкаНаОтгрузку/ManagerModule.bsl
Функция  ПолучитьТекущийСтатусЗаявкиНаОтгрузку(Ссылка) Экспорт
	
	Запрос = новый Запрос;


	Запрос.Текст = 	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               	|	ttk_ИзменениеСтатусовЗаявокНаОтгрузкуСрезПоследних.Статус
	               	|ИЗ
	               	|	РегистрСведений.ttk_ИзменениеСтатусовЗаявокНаОтгрузку.СрезПоследних(, ЗаявкаНаОтгрузку = &ЗаявкаНаОтгрузку) КАК ttk_ИзменениеСтатусовЗаявокНаОтгрузкуСрезПоследних";


	Запрос.УстановитьПараметр("ЗаявкаНаОтгрузку",Ссылка);

	Выборка =ЗАпрос.Выполнить().Выбрать();


	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Статус;
		
	Иначе
		
		Возврат Перечисления.ttk_СтатусыЗаявокНаОтгрузку.ПустаяСсылка();
		
	КонецЕсли;
	
	
КонецФункции
